src/build_it/vanillajs-validation.org
#+title: 用简单的方式实现前验校验根本不需要任何插件

* what is validation

* simple start file

html file
#+name: html
#+begin_src html
  <form>
    <label for="choose">Would you prefer a banana or cherry?</label>
    <input id="choose" name="i-like" />
    <button>Submit</button>
  </form>
#+end_src

css file
#+name: css
#+begin_src css
input:invalid {
  border: 2px dashed red;
}

input:valid {
  border: 2px solid black;
}
#+end_src

#+html: <form><style>input:invalid{border: 2px dashed red;}input:valid{border: 2px solid black;}form{border:1px solid gray;border-radius:4px;padding:16px;}</style><label for="choose">Would you prefer a banana or cherry?</label><input id="choose" name="i-like" /><button>Submit</button></form>

* html + css

** require attribute

** regular expression validating

** length of value

** type of input

* with buid-in api

** element validation api

** customized

** example

* html + css + javascript

* add more validation with functional programming

* react + ramda

* with promise

* summary
